<?
require($_SERVER["DOCUMENT_ROOT"]."/bitrix/header.php");
$APPLICATION->SetTitle("Условия возврата товара");
?><div class="about-section mb-80">
	<div class="container">
		<div class="row">
			<div class="col-md-12">
				<div class="section-title text-left ">
					<h2 class="uppercase">Условия возврата товара</h2>
					<h6 class="mb-40">Условия возврата товара при браке. Защита прав потребителя.</h6>
				</div>
			</div>
		</div>
		<div class="row">
			<div class="col-md-5">
				<div class="about-photo p-20 bg-img-1">
 <img alt="возврат.jpg" src="/upload/medialibrary/183/183348ebc0c0546059fdd2e9295bdadc.jpg" title="возврат.jpg">
				</div>
			</div>
			<div class="col-md-7">
				<div class="about-description">
					<div>
 						<b>Возврат товара:</b>
					</div>
					<p>
						 Возврат товара осуществляет только при обращении в наш розничный магазин по адресу: <br><b>г. Минск ул. Уручская 19 павильон 3М</b>.
					</p>
					<p>
						 Процедура возврата каждого продукта индивидуальна и соответсвует законам РБ. Условия возврата, гарантийные сроки, гарантийные обязательства клиента и продавца для каждого продукта указана в гарантийном талоне для каждого товара в отдельности.<br>
					</p>
					<p>
						 Просим вас внимательно ознакамливаться с прилагаемыми документами при покупке товаров.
					</p>
					<div>
 						<b>Возврат денег:</b>
					</div>
					<p>
						 Возврат денег производится в зависимости от формы оплаты за товар.</p>
					<p> 
					1) При оплате наличными деньгами, деньги будут возвращены в полном объеме в кассе магазина. <br>
					2) При оплате банковской картой деньги будут возвращены в полном объеме на ту банковскую карту с которой был произведен платеж за товар.</p>
					</div>
				</div>
			</div>
		</div>
	</div>
</div>
 <br><?require($_SERVER["DOCUMENT_ROOT"]."/bitrix/footer.php");?>